/** @file
  Strings for H2O USB Viewer

;******************************************************************************
;* Copyright 2021 Insyde Software Corp. All Rights Reserved.
;*
;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
;* transmit, broadcast, present, recite, release, license or otherwise exploit
;* any part of this publication in any form, by any means, without the prior
;* written permission of Insyde Software Corp.
;*
;******************************************************************************
*/

/=#

#include "Standard.uni"

#string STR_BLANK_STRING                                         #language en-US ""

#string STR_H2O_USB_VIEWER_FORMSET                               #language en-US "USB Device Viewer"
#string STR_H2O_USB_VIEWER_FORMSET_HELP                          #language en-US "Shows information of all attached USB devices"

#string STR_FLAT_VIEW                                            #language en-US "Flat View"
#string STR_FLAT_VIEW_HELP                                       #language en-US "Flat View: Show all connected USB host controllers, hubs and devices in one list.\n"
                                                                                 "Disable: List devices in directories by the upstream hub connected to."

#string STR_REFRESH_ACTION                                       #language en-US "Refresh"
#string STR_REFRESH_ACTION_HELP                                  #language en-US "Select to refresh this form."

#string STR_USB_DEVICE_FORM_SUBTITLE                             #language en-US ""
#string STR_DISCONNECTED_DEVICE_PROMPT                           #language en-US ""
#string STR_USB_DEVICE_COUNT_SUBTITLE                            #language en-US ""

#string STR_USB_HOST_CONTROLLER_FORM                             #language en-US ""
#string STR_USB_DEPTH_0_DEVICE_FORM                              #language en-US ""
#string STR_USB_DEPTH_1_DEVICE_FORM                              #language en-US ""
#string STR_USB_DEPTH_2_DEVICE_FORM                              #language en-US ""
#string STR_USB_DEPTH_3_DEVICE_FORM                              #language en-US ""
#string STR_USB_DEPTH_4_DEVICE_FORM                              #language en-US ""
#string STR_USB_DEPTH_5_DEVICE_FORM                              #language en-US ""

#string STR_FORM_CALLBACK_REQUIRED                               #language en-US "(Form callback required to show USB device information.)"
#string STR_NO_USB_HOST_CONTROLLER                               #language en-US "No USB host controller found"

#string STR_USB_HOST_GOTO_OP_ENTRY_FORMAT                        #language en-US "%s: USB %s (%s)%s"
#string STR_UHCI                                                 #language en-US "UHCI"
#string STR_OHCI                                                 #language en-US "OHCI"
#string STR_EHCI                                                 #language en-US "EHCI"
#string STR_XHCI                                                 #language en-US "xHCI"
#string STR_OTHER_HOST_INTERFACE                                 #language en-US "Other interface"
#string STR_USB_PRE_1_0                                          #language en-US "Pre-1.0"
#string STR_USB_1_X                                              #language en-US "1.x"

#string STR_USB_DEVICE_COUNT_SUBSTRING_FORMAT                    #language en-US "; %lu device(s)"
                                                                 #language zh-TW "\wide（\narrow%lu \wide個裝置）\narrow"
#string STR_USB_HUB_COUNT_SUBSTRING_FORMAT                       #language en-US "; %lu hub(s)"
                                                                 #language zh-TW "\wide（\narrow%lu \wide個集線器）\narrow"
#string STR_USB_PORT_COUNT_SUBSTRING_FORMAT                      #language en-US "; %u port(s)"
                                                                 #language zh-TW "\wide（\narrow%u \wide個埠）\narrow"
#string STR_USB_NEW_DEVICE_SUBSTRING                             #language en-US " (New)"
                                                                 #language zh-TW "\wide（新）\narrow"

#string STR_USB_HOST_CONTROLLER_GOTO_HELP_FORMAT                 #language en-US "Click to show detailed information of this host controller.\n"
                                                                                 "%lu downstream peripheral(s)\n"
                                                                                 "%lu downstream hub(s)"

#string STR_USB_HUB_GOTO_HELP_FORMAT                             #language en-US "Click to show detailed information of this USB hub.\n"
                                                                                 "%s(Port %s)\n"
                                                                                 "%lu downstream peripheral(s)\n"
                                                                                 "%lu downstream hub(s)\n"
                                                                                 "\n"
                                                                                 "Manufacturer: %s\n"
                                                                                 "Product: %s\n"
                                                                                 "Serial Number: %s\n"
                                                                                 "Device Release Number: %04X"

#string STR_USB_DEVICE_GOTO_HELP_FORMAT                          #language en-US "Click to show detailed information of this USB device.\n"
                                                                                 "%s(Port %s)\n"
                                                                                 "\n"
                                                                                 "Manufacturer: %s\n"
                                                                                 "Product: %s\n"
                                                                                 "Serial Number: %s\n"
                                                                                 "Device Release Number: %04X\n"
                                                                                 "Number of Interfaces: %u"

#string STR_USB_SHOW_HOST_CONTROLLER_INFORMATION                 #language en-US "Show Host Controller Information"
#string STR_USB_HIDE_HOST_CONTROLLER_INFORMATION                 #language en-US "Hide Host Controller Information"
#string STR_USB_SHOW_HUB_INFORMATION                             #language en-US "Show Hub Information"
#string STR_USB_HIDE_HUB_INFORMATION                             #language en-US "Hide Hub Information"
#string STR_USB_NUM_OF_PORTS_PROMPT                              #language en-US "Number of Ports"
#string STR_USB_HC_NUM_OF_PORTS_HELP                             #language en-US "The number of ports provided by this host controller, including ports that are internal and have no connectors."
#string STR_DISCONNECTED_DEVICE_PROMPT_FORMAT                    #language en-US "[Disconnected: %s]"
#string STR_USB_PORTS_LIST                                       #language en-US "Ports List"
#string STR_USB_DEVICE_COUNT_SUBTITLE_FORMAT                     #language en-US "Total: %lu peripheral(s); %lu hub(s)%s"
#string STR_HOST_CONTROLLER_COUNT_SUBSTRING_FORMAT               #language en-US "; %u host controller(s)"
#string STR_GO_BACK_PROMPT                                       #language en-US "Go Back"
#string STR_GO_BACK_HELP                                         #language en-US "Go back to last connected upstream device."

#string STR_YES                                                  #language en-US "Yes"
#string STR_NO                                                   #language en-US "No"

#string STR_PCI_LOCATION_PROMPT                                  #language en-US "PCI Location"
#string STR_PCI_LOCATION_VALUE_FORMAT_NOSEG                      #language en-US "Bus %u Device %u Function %u"
#string STR_PCI_LOCATION_VALUE_FORMAT_FULL                       #language en-US "%04x:%02x:%02x.%x" // Same notation as in Linux kernel and 'lspci' utility for Unixes.
#string STR_PCI_LOCATION_HELP_FORMAT_NOSEG                       #language en-US "The PCI location of the USB host controller.\nBus %u Device %u Function %u"
#string STR_PCI_LOCATION_HELP_FORMAT_FULL                        #language en-US "The PCI location of the USB host controller.\nSegment %u Bus %u Device %u Function %u"
#string STR_PCI_VENDOR_ID                                        #language en-US "PCI Vendor ID"
#string STR_PCI_DEVICE_ID                                        #language en-US "PCI Device ID"
#string STR_PCI_REVISION_ID                                      #language en-US "Device Revision ID"
#string STR_PCI_SUBSYSTEM_VENDOR_ID                              #language en-US "Subsystem Vendor ID"
#string STR_PCI_SUBSYSTEM_ID                                     #language en-US "Subsystem ID"
#string STR_USB_HC_GENERIC_INFORMATION_HELP                      #language en-US "This information is provided by the USB host controller."
#string STR_HCI_REVISION                                         #language en-US "HCI Revision"
#string STR_64_BIT_ADDRESS_CAPABLE                               #language en-US "64-bit Address Capable"
#string STR_EFI_DEVICE_PATH                                      #language en-US "EFI Device Path"

#string STR_NOT_AVAILABLE                                        #language en-US "N/A"
#string STR_USB_DEVICE_DESCRIPTOR_HELP                           #language en-US "This information is provided by the USB device."

#string STR_MANUFACTURER_PROMPT                                  #language en-US "Manufacturer"
#string STR_PRODUCT_PROMPT                                       #language en-US "Product"
#string STR_SERIAL_NUMBER_PROMPT                                 #language en-US "Serial Number"
#string STR_DEVICE_VENDOR_AND_PRODUCT_ID                         #language en-US "Vendor & Product ID"
#string STR_DEVICE_RELEASE_NUMBER                                #language en-US "Device Release Number"
#string STR_DEVICE_CLASS_CODE                                    #language en-US "Class Code"
#string STR_DEVICE_SUBCLASS_CODE                                 #language en-US "Subclass Code"
#string STR_DEVICE_PROTOCOL_CODE                                 #language en-US "Protocol Code"
#string STR_DEVICE_CLASS_CODE_HELP_FORMAT                        #language en-US "%s %02xh\n%s"

#string STR_NUM_OF_CONFIGURATIONS_PROMPT                         #language en-US "Num of Configurations" // Field title abbreviated because of screen width constraints.
#string STR_NUM_OF_CONFIGURATIONS_HELP                           #language en-US "Number of Configurations available for this USB device."
#string STR_CURRENT_CONFIGURATION_PROMPT                         #language en-US "Configuration Value"
#string STR_CURRENT_CONFIGURATION_HELP                           #language en-US "The Configuration value currently set to the USB device by the host computer. Configuration number starts from one."
#string STR_CONFIGURATION_DESCRIPTION_PROMPT                     #language en-US "Config Description" // Field title abbreviated because of screen width constraints.
#string STR_CONFIGURATION_DESCRIPTION_HELP                       #language en-US "Description string for the current Configuration. This information is provided by the USB device."
#string STR_NUM_OF_INTERFACES_PROMPT                             #language en-US "Number of Interfaces"
#string STR_NUM_OF_INTERFACES_HELP                               #language en-US "Number of Interfaces (N) supported by the current Configuration. Interfaces are numbered from zero to (N-1). Description string for each Interface might be provided by the device."

#string STR_USB_INTERFACE_SUBTITLE_FORMAT                        #language en-US "Interface %u| (Description: \"%s\")"
#string STR_SELECTED_ALTERNATE_SETTING_PROMPT                    #language en-US "Alternate Setting"
#string STR_SELECTED_ALTERNATE_SETTING_HELP                      #language en-US "The current Alternate Setting value for this USB interface."
#string STR_NUM_OF_ENDPOINTS_PROMPT                              #language en-US "Number of Endpoints"
#string STR_NUM_OF_ENDPOINTS_HELP                                #language en-US "Number of Endpoints used by this USB interface (excluding the Default Control Pipe). This information is provided by the USB device."

#string STR_MEDIA_CAPACITY_PROMPT                                #language en-US "Capacity"
//
// Space constraint prevents us from including all digits, but distinguishing
// sizes in decimal and binary multiples is *very* helpful.
//
// Superscript 4, 5, and 6 (U+2074, U+2075 and U+2076) are not supported in any
// H2O Setup display engine.
//
#string STR_MEDIA_CAPACITY_HELP_FORMAT                           #language en-US "%s\n"
                                                                                 "(%s bytes)\n"
                                                                                 "\n"
                                                                                 "Number of Logical Blocks: %,lu\n"
                                                                                 "Logical Block Size: %,u bytes"

//
// End of file
//